#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
module.ubunturoutervm.data.template_file.cloudconfig_linux: Reading...
random_id.id_flow: Refreshing state... [id=ufv5w2ozwO8]
module.ubunturoutervm.random_id.randomIdVM: Refreshing state... [id=qQ9YUoT6nBQ]
module.ubunturoutervm.random_id.randomid_pip[0]: Refreshing state... [id=N4jWfw]
module.ubunturoutervm.data.template_file.cloudconfig_linux: Read complete after 0s [id=78034a915ae7e28245eef0578a8e8008174bc44c2af78c9ba4a469a398498927]
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Reading...
module.ubunturoutervm.data.template_cloudinit_config.config_linux: Read complete after 0s [id=1084986733]
module.spoke1network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001]
azurerm_resource_group.rg_compute: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001]
data.azurerm_key_vault.secrets: Reading...
module.spoke2network.azurerm_resource_group.rg-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001]
azurerm_resource_group.rg_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001]
module.ubunturoutervm.azurerm_public_ip.pip_spokevmnic[0]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/publicIPAddresses/pip-vm-hub-dev-001]
azurerm_virtual_network.hub_vnet: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001]
azurerm_log_analytics_workspace.law_platform: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.OperationalInsights/workspaces/law-platform]
azurerm_network_watcher.networkwatcher_hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub]
azurerm_storage_account.flow: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Storage/storageAccounts/stflowb9fbf9c36a33c0ef]
azurerm_network_security_group.nsg_router: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router]
module.spoke2network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001]
module.spoke2network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001]
module.spoke1network.azurerm_route_table.spoke-rt-table: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001]
module.spoke1network.azurerm_virtual_network.vnet-spoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001]
data.azurerm_monitor_diagnostic_categories.nsg_logs: Reading...
azurerm_subnet.hub_subnet["RouterSubnet"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/subnets/RouterSubnet]
data.azurerm_monitor_diagnostic_categories.nsg_logs: Read complete after 1s [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router]
azurerm_subnet_network_security_group_association.nsg_router-association: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/subnets/RouterSubnet]
module.ubunturoutervm.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-hub-dev-001-a90f585284fa9c14]
module.spoke1network.azurerm_subnet.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.spoke1network.azurerm_subnet.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/virtualNetworkPeerings/hub-vnet-spoke1-001]
module.spoke1network.azurerm_subnet.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke1network.azurerm_virtual_network_peering.spokehub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/virtualNetworkPeerings/vnet-spoke1-001-hub]
module.spoke2network.azurerm_virtual_network_peering.spokehub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/virtualNetworkPeerings/vnet-spoke2-001-hub]
module.spoke2network.azurerm_virtual_network_peering.hubspoke: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/virtualNetworks/vnet-hub-001/virtualNetworkPeerings/hub-vnet-spoke2-001]
module.spoke2network.azurerm_subnet.subnet-spoke["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
module.spoke2network.azurerm_subnet.subnet-spoke["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.spoke2network.azurerm_subnet.subnet-spoke["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
azurerm_monitor_diagnostic_setting.nsg_router: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkSecurityGroups/nsg_router|nsg_router_diag]
module.spoke2network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke2-001/routes/default-route-entry]
module.spoke1network.azurerm_route.default-route: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/routeTables/rt-vnet-spoke1-001/routes/default-route-entry]
data.azurerm_key_vault.secrets: Read complete after 3s [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-tf-infra-001/providers/Microsoft.KeyVault/vaults/kv-tf-infra-sec-001]
data.azurerm_key_vault_secret.vmpassword: Reading...
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier]
module.spoke1network.azurerm_subnet_route_table_association.route_table_association["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["DatabaseTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["LogicTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier]
module.spoke2network.azurerm_subnet_route_table_association.route_table_association["WebTier"]: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier]
data.azurerm_key_vault_secret.vmpassword: Read complete after 2s [id=https://kv-tf-infra-sec-001.vault.azure.net/secrets/vmpassword/cd3cca8343d14d4890d1645375fe30fc]
module.ubunturoutervm.azurerm_linux_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001]
azurerm_virtual_machine_extension.ubunturoutervm_networkwatcher: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-hub-dev-001/extensions/vm-hub-dev-001-networkwatcher]
module.ubuntuspoke1.data.template_file.cloudconfig_linux: Reading...
module.ubuntuspoke2.data.template_file.cloudconfig_linux: Reading...
module.ubuntuspoke2.random_id.randomIdVM: Refreshing state... [id=6Z5NKFxmZaQ]
module.ubuntuspoke1.data.template_file.cloudconfig_linux: Read complete after 0s [id=d13e49c8fd9541d78852e0ab770d293f4b2131cdadf6da9db57074c8291c1f41]
module.ubuntuspoke2.data.template_file.cloudconfig_linux: Read complete after 0s [id=d13e49c8fd9541d78852e0ab770d293f4b2131cdadf6da9db57074c8291c1f41]
module.ubuntuspoke1.random_id.randomIdVM: Refreshing state... [id=RHBx4BeBJoU]
module.ubuntuspoke1.data.template_cloudinit_config.config_linux: Reading...
module.ubuntuspoke2.data.template_cloudinit_config.config_linux: Reading...
module.ubuntuspoke1.data.template_cloudinit_config.config_linux: Read complete after 0s [id=2389926595]
module.ubuntuspoke2.data.template_cloudinit_config.config_linux: Read complete after 0s [id=2389926595]
module.ubuntuspoke2.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke2-dev-001-e99e4d285c6665a4]
module.ubuntuspoke1.azurerm_network_interface.spokevmnic: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Network/networkInterfaces/nic-vm-spoke1-dev-001-447071e017812685]
module.ubuntuspoke1.azurerm_linux_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001]
module.ubuntuspoke2.azurerm_linux_virtual_machine.spokevm: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001]
azurerm_network_connection_monitor.ubunturoutervm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-hub-dev-001-ubuntucom]
azurerm_network_watcher_flow_log.spoke2: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/spoke2flow]
azurerm_network_watcher_flow_log.hub: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/hub-flow]
azurerm_network_watcher_flow_log.spoke1: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/flowLogs/spoke1-flow]
azurerm_virtual_machine_extension.spoke1vm_networkwatcher: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke1-dev-001/extensions/vm-spoke1-dev-001-networkwatcher]
azurerm_virtual_machine_extension.spoke2vm_networkwatcher: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-compute-001/providers/Microsoft.Compute/virtualMachines/vm-spoke2-dev-001/extensions/vm-spoke2-dev-001-networkwatcher]
azurerm_network_connection_monitor.spoke1vm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke1-dev-001-ubuntucom]
azurerm_network_connection_monitor.spoke2vm_monitor_ubuntucom: Refreshing state... [id=/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-net-hub-001/providers/Microsoft.Network/networkWatchers/network-watcher-hub/connectionMonitors/vm-spoke2-dev-001-ubuntucom]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.spoke1network.azurerm_network_security_group.subnet-spoke["DatabaseTier"] will be created
  + resource "azurerm_network_security_group" "subnet-spoke" {
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "nsg-DatabaseTier"
      + resource_group_name = "rg-spoke1-001"
      + security_rule       = (known after apply)
      + tags                = {
          + "environment" = "Dev"
        }
    }

  # module.spoke1network.azurerm_network_security_group.subnet-spoke["LogicTier"] will be created
  + resource "azurerm_network_security_group" "subnet-spoke" {
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "nsg-LogicTier"
      + resource_group_name = "rg-spoke1-001"
      + security_rule       = (known after apply)
      + tags                = {
          + "environment" = "Dev"
        }
    }

  # module.spoke1network.azurerm_network_security_group.subnet-spoke["WebTier"] will be created
  + resource "azurerm_network_security_group" "subnet-spoke" {
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "nsg-WebTier"
      + resource_group_name = "rg-spoke1-001"
      + security_rule       = (known after apply)
      + tags                = {
          + "environment" = "Dev"
        }
    }

  # module.spoke1network.azurerm_subnet_network_security_group_association.subnet-spoke["DatabaseTier"] will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet-spoke" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/DatabaseTier"
    }

  # module.spoke1network.azurerm_subnet_network_security_group_association.subnet-spoke["LogicTier"] will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet-spoke" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/LogicTier"
    }

  # module.spoke1network.azurerm_subnet_network_security_group_association.subnet-spoke["WebTier"] will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet-spoke" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke1-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke1-001/subnets/WebTier"
    }

  # module.spoke2network.azurerm_network_security_group.subnet-spoke["DatabaseTier"] will be created
  + resource "azurerm_network_security_group" "subnet-spoke" {
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "nsg-DatabaseTier"
      + resource_group_name = "rg-spoke2-001"
      + security_rule       = (known after apply)
      + tags                = {
          + "environment" = "Dev"
        }
    }

  # module.spoke2network.azurerm_network_security_group.subnet-spoke["LogicTier"] will be created
  + resource "azurerm_network_security_group" "subnet-spoke" {
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "nsg-LogicTier"
      + resource_group_name = "rg-spoke2-001"
      + security_rule       = (known after apply)
      + tags                = {
          + "environment" = "Dev"
        }
    }

  # module.spoke2network.azurerm_network_security_group.subnet-spoke["WebTier"] will be created
  + resource "azurerm_network_security_group" "subnet-spoke" {
      + id                  = (known after apply)
      + location            = "swedencentral"
      + name                = "nsg-WebTier"
      + resource_group_name = "rg-spoke2-001"
      + security_rule       = (known after apply)
      + tags                = {
          + "environment" = "Dev"
        }
    }

  # module.spoke2network.azurerm_subnet_network_security_group_association.subnet-spoke["DatabaseTier"] will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet-spoke" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/DatabaseTier"
    }

  # module.spoke2network.azurerm_subnet_network_security_group_association.subnet-spoke["LogicTier"] will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet-spoke" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/LogicTier"
    }

  # module.spoke2network.azurerm_subnet_network_security_group_association.subnet-spoke["WebTier"] will be created
  + resource "azurerm_subnet_network_security_group_association" "subnet-spoke" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = "/subscriptions/85f4c871-0572-44e7-830e-de36fb870a37/resourceGroups/rg-spoke2-001/providers/Microsoft.Network/virtualNetworks/vnet-spoke2-001/subnets/WebTier"
    }

Plan: 12 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @vMarkusK, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*